// ---1---
// Перепишіть функцію, використовуючи '?' або '||'
// function checkAge(age) {
//   age > 18 ? true : confirm("Батьки дозволили?");
// }
// checkAge();
// ---2---
// Напишіть функцію min(a, b), яка повертає менше з двох чисел a та b.
// function min(a, b) {
//   if (a < b) {
//     return console.log(a);
//   }
//   return console.log(b);
// }
// min(12, 23);
// ---3---
// Перепишіть з використанням стрілкових функцій
// Замініть Функціональні Вирази на стрілкові функції у коді нижче:Перепишіть з використанням стрілкових функцій

// const ask = (question, yes, no) => {
//   if (confirm(question)) yes();
//   else no();
// };
// const Yes = () => {
//   alert("Ви погодились.");
// };
// const No = () => {
//   alert("Ви скасували виконання.");
// };
// ask("Ви згодні?", Yes, No);
